In [1]:
import pandas as pd 
dict={"NAME":["Adam","Bob","Catherine","David","Eva"],
      "AGE":[24,25,20,22,23],
      "CITY":["Earth","Heaven","Hell","Unknown","Earth"]}
df=pd.DataFrame(dict)
print("head:")
print(df.head(2))
print("tail:")
print(df.tail(2))

head:
   NAME  AGE    CITY
0  Adam   24   Earth
1   Bob   25  Heaven
tail:
    NAME  AGE     CITY
3  David   22  Unknown
4    Eva   23    Earth

In [2]:
df.head()

        NAME  AGE     CITY
0       Adam   24    Earth
1        Bob   25   Heaven
2  Catherine   20     Hell
3      David   22  Unknown
4        Eva   23    Earth

In [3]:
#this will give the last 2 rows of the tables, tail is used to print the rows from bottom
df.tail(2)

    NAME  AGE     CITY
3  David   22  Unknown
4    Eva   23    Earth

In [4]:
#to get info of data, that is which col holds which type of data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    5 non-null      object
 1   AGE     5 non-null      int64
 2   CITY    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [5]:
#to give the summary of statistics of the numerical data in the dataframe 
df.describe()

             AGE
count   5.000000
mean   22.800000
std     1.923538
min    20.000000
25%    22.000000
50%    23.000000
75%    24.000000
max    25.000000

In [6]:
#returns the datatype of each col in the dataframe
df.dtypes

NAME    object
AGE      int64
CITY    object
dtype: object

In [7]:
#to return the labels of col
df.columns

Index(['NAME', 'AGE', 'CITY'], dtype='object')

In [8]:
#to get all the values in the columns
df.values

array([['Adam', 24, 'Earth'],
       ['Bob', 25, 'Heaven'],
       ['Catherine', 20, 'Hell'],
       ['David', 22, 'Unknown'],
       ['Eva', 23, 'Earth']], dtype=object)

In [9]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
#to get an entire column: df[column_name]
df['AGE']

0    24
1    25
2    20
3    22
4    23
Name: AGE, dtype: int64

In [11]:
#to access a row using integer position 
df.loc[3]

NAME      David
AGE          22
CITY    Unknown
Name: 3, dtype: object

In [12]:
#to sort the dataframe 
df_sorted=df.sort_values(by='AGE', ascending=True)
df_sorted

        NAME  AGE     CITY
2  Catherine   20     Hell
3      David   22  Unknown
4        Eva   23    Earth
0       Adam   24    Earth
1        Bob   25   Heaven

In [13]:
#to print avg age
avg_age=df.groupby('NAME')['AGE'].mean()
avg_age

NAME
Adam         24.0
Bob          25.0
Catherine    20.0
David        22.0
Eva          23.0
Name: AGE, dtype: float64

In [14]:
#to get missing values
missing_values = df.isna()
missing_values

    NAME    AGE   CITY
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [15]:
#to get duplicates
duplicates= df.duplicated()
duplicates

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [16]:
#to drop duplicate
df.drop_duplicates()
df

        NAME  AGE     CITY
0       Adam   24    Earth
1        Bob   25   Heaven
2  Catherine   20     Hell
3      David   22  Unknown
4        Eva   23    Earth

In [17]:
#to get a tuple of no of rows and columns
df.shape

(5, 3)